Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: སྦྱིན་སྲེག་ཟ་དང་སྐྱེ་དགུ་དང་། །སྟོབས་ཆེན་ཕ་རོལ་གནོན་བྱེད་པ། །འཇིག་རྟེན་སྐྱོང་བ་དེ་ཀུན་ཀྱང་། །ཉིན་མཚན་གཡེལ་བ་མེད་པར་ནི། །དེ་དག་རྣམས་ལ་སྲུང་བར་བྱེད། །སྟོབས་ཆེན་གནོད་སྦྱིན་དབང་གཉིས་དང་། །སྲེད་མེད་བུ་དང་དབང་ཕྱུག་ཆེ། །ཡང་དག་ཤེས་ལ་སོགས་པ་དག །
en: “Indra, Soma, and Yama, Vāyu and Varuṇa, Skanda, Viṣṇu, Sarasvatī, Consumer of Burnt Offerings, and Prajāpati, “Those who with great power subjugate adversaries, All those protectors of the world, Day and night, never inattentive, Will give them their protection.

source: གཞན་ཡང་ཉི་ཤུ་རྩ་བརྒྱད་དང་། །གནོད་སྦྱིན་བརྒྱ་ཕྲག་སྟོང་པོ་དག །སྟོབས་ཆེན་རྫུ་འཕྲུལ་ལྡན་རྣམས་ཀྱིས། །འཇིགས་ཤིང་སྐྲག་པ་ཐམས་ཅད་ནི། །དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །
en: “The yakṣa lords that have great might— Nārāyaṇa and Maheśvara, Saṃjñeya, and also the rest of The other twenty-eight yakṣas, “And the hundred thousand yakṣas With their great might and miraculous powers— Will give them their protection From all terror and fears.

source: ལག་ན་རྡོ་རྗེ་གནོད་སྦྱིན་དབང་། །གནོད་སྦྱིན་དག་ནི་ལྔ་བརྒྱ་དང་། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱང་། །དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །གནོད་སྦྱིན་དབང་པོ་ནོར་བུ་བཟང་། །དེ་བཞིན་གང་བ་བཟང་པོ་དང་། །
en: “Vajrapāṇi, the lord of yakṣas, With five hundred yakṣas And all the bodhisattvas, Will give them his protection.

source: ཇི་འཇིགས་དང་ནི་འབྲོག་གནས་དང་། །དམར་སེར་དང་ནི་སེར་སྐྱ་དང་། །གནོད་སྦྱིན་དབང་པོ་རེ་རེ་ཡང་། །གནོད་སྦྱིན་ལྔ་བརྒྱ་དག་གིས་ནི། །གང་དག་མདོ་སྡེ་འདི་ཐོས་པ། །དེ་དག་རྣམས་ལ་སྲུང་བྱེད་འགྱུར། །དྲི་ཟ་སྣ་ཚོགས་སྡེ་དང་ནི། །རྒྱལ་བ་ཁྱུ་མཆོག་རྒྱལ་བའི་རྒྱལ། །ནོར་བུའི་མགུལ་དང་ངེས་མགྲིན་དང་། །དེ་བཞིན་ཆར་པའི་བདག་པོ་དང་། །ཀམ་པོ་ཇི་དང་ནག་པོ་དང་། །དེ་བཞིན་གསེར་འདྲའི་སྐྲ་དང་ནི། །ལྔས་རྩེན་དང་ནི་ར་རྐང་དང་། །
en: “Maṇibhadra, the lord of yakṣas, And similarly, Pūrṇabhadra, Kumbhīra and Aṭāvika, Piṅgala and Kapila— “Each of those lords of yakṣas, Accompanied by five hundred yakṣas— Will give their protection to Those who listen to this sūtra.

source: དེ་བཞིན་སྐལ་བ་ཆེན་པོ་དང་། །ཡུར་བ་ཅན་དང་ཆོས་སྐྱོང་དང་། །སྤྲེའུ་དང་དེ་བཞིན་འཁྲི་བྱེད་དང་། །ཁབ་ཀྱི་སྤུ་དང་གཉིས་བཤེས་དང་། །དེ་བཞིན་རིན་ཆེན་སྐྲ་དང་ནི། །ཡུལ་ཆེན་ཅན་དང་ཁྱིམ་མེད་དང་། །འདོད་པའི་མཆོག་དང་ཙནྡན་དང་། །མཐུ་བོ་ཆེ་དང་གངས་ཅན་དང་། །བདེ་བའི་རི་ཉིད་དེ་བཞིན་ཏེ། །སྟོབས་ཆེན་ཕ་རོལ་གནོན་བྱེད་པ། །རྫུ་འཕྲུལ་ལྡན་པ་དེ་ཀུན་ཀྱང་། །གང་དག་མདོ་སྡེ་འདི་དགའ་བ། །དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །ཀླུ་ཡི་དབང་པོ་མ་དྲོས་དང་། །དེ་བཞིན་དུ་ཡང་རྒྱ་མཚོ་དང་། །ཨེ་ལའི་འདབ་དང་བཏང་བཟུང་དང་། །དགའ་བོ་ཉེ་དགའ་གཉི་ག་དང་། །
en: “Gandharva and Citrasena, Jinarāja and Jinarṣabha, Maṇikaṇṭha and Nikaṇṭha, And similarly Varṣādhipati; “Mahāgrāsa and Mahākāla, And similarly also Svarṇakeśin, Pāñcika and Chagalapāda, And similarly Mahābhāga; “Praṇālin and Dharma Protector, Markaṭa and also Vāli, Sūciroma and Sūryamitra, And similarly Ratnakeśa; “Mahāpraṇālin and Nakula, Kāmaśreṣṭha and Candana, Nāgāyana and Haimavata, And similarly Sātāgirista— “All of them, who have great might, Subjugate adversaries, and have miraculous power— Will give their protection to Those who listen to this sūtra.

source: ཀླུ་ནི་བརྒྱ་ཕྲག་སྟོང་པོ་དག །སྟོབས་ཆེན་རྫུ་འཕྲུལ་ལྡན་རྣམས་ཀྱང་། །འཇིགས་ཤིང་སྐྲག་པ་ཐམས་ཅད་ལས། །དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །སྟོབས་ཅན་སྒྲ་གཅན་མི་གཏོང་དང་། །ཐགས་བཟངས་རིས་དང་བདེ་མཆོག་དང་། །
en: “The nāga lord Anavatapta, And similarly Sāgara, Both Elapatra and Mucilinda, And Nanda and Upananda, “With a hundred thousand nāgas With great might and miraculous powers, Will give them their protection From all terrors and fears.

source: རབ་སིམ་བྱེད་དང་ཕྲག་རྩུབ་དང་། །དེ་བཞིན་ལྷ་མིན་དབང་གཞན་དང་། །ལྷ་མིན་བརྒྱ་ཕྲག་སྟོང་པོ་དག །སྟོབས་ཆེན་རྫུ་འཕྲུལ་ལྡན་རྣམས་ཀྱིས། །འཇིགས་སྐྲག་བྱུང་བར་གྱུར་པ་ལས། །དེ་དག་ལ་ནི་བསྲུང་བར་འགྱུར། །
en: “Bali, Rāhu, and Namuci, Vemacitra and Saṃvara, Prahrāda and Kharaskandha, And similarly the other lords of asuras, “With a hundred thousand asuras With great might and miraculous powers, Will give them their protection From all terrors and fears.

source: འབྱུང་པོའི་མ་མོ་འཕྲོག་མ་ནི། །ལྔ་བརྒྱའི་བུ་དང་བཅས་པ་ཡང་། །འདུག་དང་ཉལ་དང་ར་རོའི་ཚེ། །དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །གདོལ་པ་མོ་དང་གཏུམ་མོ་དང་། །དེ་བཞིན་གནོད་སྦྱིན་གཏུམ་མོ་དང་། །
en: “Hārītī, the mother of spirits, With her five hundred children, Will give them their protection While they sit, sleep, or are intoxicated.

source: མདུང་ཅན་དང་ནི་སོ་བརྩེགས་དང་། །སེམས་ཅན་ཀུན་གྱི་མདངས་འཕྲོག་མ། །སྟོབས་ཆེན་ཕ་རོལ་གནོན་བྱེད་པ། །རྫུ་འཕྲུལ་ལྡན་པ་དེ་ཀུན་ཀྱང་། །ཕྱོགས་བཞི་དག་ནི་ཀུན་ནས་སུ། །དེ་དག་རྣམས་ལ་སྲུང་བར་བྱེད། །དབྱངས་ཅན་དག་ལ་སོགས་པ་རྣམས། །ལྷ་མོ་བསམ་གྱིས་མི་ཁྱབ་དང་། །
en: “Caṇḍā and Caṇḍālikā, And similarly the yakṣiṇīs Caṇḍikā, Armed with Spear and Kūṭadantī, And also Seeing All Sentient Beings— “All of them, who have great might, Subjugate adversaries, and have miraculous power— Will give their protection to them Everywhere in the four directions.

source: དཔལ་ལ་སོགས་པ་དེ་བཞིན་དུ། །ལྷ་མོ་དག་ནི་ཐམས་ཅད་དང་། །ས་ཡི་ལྷ་མོ་ཉིད་དང་ནི། །ལོ་ཏོག་འབྲས་བུ་ནགས་ལྷ་དང་། །ཀུན་དགའ་ཤིང་ལྗོན་མཆོད་རྟེན་ལ། །གནས་པ་དག་དང་རླུང་ལྷ་དང་། །ལྷ་རྣམས་དེ་དག་ཐམས་ཅད་འདིར། །རབ་ཏུ་དགའ་བའི་སེམས་ཀྱིས་ནི། །གང་དག་མདོ་སྡེ་འདི་དགའ་བ། །
en: “Sarasvatī and all the other Countless numbers of goddesses, And similarly Śrī and All of the other goddesses— “The goddess of the earth and The goddesses of harvests, fruits, and forests; Those who dwell in parks, trees, and caityas; And the goddesses of the wind— “Every one of those goddesses, With their minds filled with joy, Will here give their protection To those who delight in this sūtra.

source: དེ་དག་རྣམས་ལ་སྲུང་བར་བྱེད། །ཚེ་དང་མདོག་དང་སྟོབས་རྣམས་ལ། །སེམས་ཅན་དག་ནི་སྦྱོར་བར་བྱེད། །དཔལ་དང་བསོད་ནམས་གཟི་བརྗིད་ཀྱིས། །ཕུན་སུམ་ཚོགས་པས་རྟག་ཏུ་བརྒྱན། །
en: “They will bestow on those beings Life and color and strength, And will constantly adorn them with perfect Glory and merit and magnificence.

source: གཟའ་དང་རྒྱུ་སྐར་གནོད་པ་དག །དེ་དག་ཐམས་ཅད་ཞི་བར་བྱེད། །
en: “They will end all harm from The planets and the lunar asterisms.

source: རྒུད་དང་སྡིག་དང་རྨི་ངན་པ། །དེ་དག་ཐམས་ཅད་ཞི་བར་བྱེད། །
en: They will bring to an end all troubles, Bad actions, and nightmares.

source: ཟབ་ཅིང་སྟོབས་ཆེན་ལྡན་པ་ཡི། །ས་ཡི་ལྷ་མོ་ཉིད་ཀྱང་ནི། །གསེར་གྱི་འོད་ཀྱི་དམ་པ་ཡི། །མདོ་སྡེའི་དབང་པོའི་རོ་ཡིས་ཚིམ། །
en: “The goddess of the earth herself, Who has depth and great strength, Will be satiated by the flavor of The Lord King of Sūtras, the Sublime Golden Light.

source: དཔག་ཚད་དག་ནི་བརྒྱ་ཡི་ཕྲག །སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ནས། །རྡོ་རྗེ་གནས་ལ་ཐུག་བར་དུ། །ས་ཡི་བཅུད་ནི་རབ་ཏུ་འཕེལ། །
en: “For sixty-eight thousand Times a hundred yojanas, As far down as the vajra foundation, The fertility of the earth will increase.

source: དཔག་ཚད་བརྒྱར་ནི་ཚང་བ་ཡི། །འོག་ཏུ་ས་ཡི་བཅུད་སོང་སྟེ། །དེ་ནི་ཕྱིར་ཡང་ལོག་ནས་ནི། །ས་ཡི་སྟེང་དག་སྣུམ་པར་བྱེད། །
en: “The fertility of the earth that has sunk A whole hundred yojanas below Will rise back upward And enrich the surfaces.

source: མདོ་སྡེ་མཉན་པའི་སྟོབས་ཀྱིས་ནི། །ལྷ་རྣམས་དེ་དག་ཐམས་ཅད་ཀྱང་། །གསེར་གྱི་འོད་ནི་དམ་པ་ཡི། །མདོ་སྡེའི་དབང་པོའི་རོས་ཚིམ་འགྱུར། །
en: “Every one of all those devas, through The power of listening to the sūtra, Will be satiated by the flavor of The Lord King of Sūtras, the Sublime Golden Light.

source: མདངས་དང་ལྡན་པར་རབ་འགྱུར་ཞིང་། །དེ་བཞིན་རབ་ཏུ་སྟོབས་ལྡན་འགྱུར། །
en: “They will become perfectly brilliant, And similarly they will have strength.

source: བདེ་བར་འགྱུར་ཞིང་ཚིམ་པར་འགྱུར། །
en: They will be happy and satisfied.

source: འཛམ་བུའི་གླིང་འདི་ཐམས་ཅད་ན། །འབྲས་བུ་ལོ་ཏོག་ནགས་ལྷ་རྣམས། །སྣ་ཚོགས་རོ་ཡིས་ཚིམ་འགྱུར་ཞིང་། །ཤིན་ཏུ་རབ་ཏུ་དགའ་བར་འགྱུར། །མདོ་སྡེའི་རོ་ཡིས་ཚིམ་འགྱུར་ནས། །
en: Throughout the entirety of Jambudvīpa, “The devas of fruits, harvests, and forests Will be satisfied by various flavors, And they will be completely delighted, Satisfied by the flavor of the sūtra.

source: འབྲས་བུ་རྣམས་དང་ལོ་ཏོག་དང་། །མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་དང་། །འབྲས་བུའི་ཤིང་ལྗོན་སྣ་ཚོགས་ཀྱང་། །ཀུན་ནས་རབ་ཏུ་སྐྱེ་བར་བྱེད། །
en: “Then the fruits and the harvests, And the various kinds of flowers And the various kinds of fruit trees, Will all develop perfectly.

source: འབྲས་བུའི་ཤིང་ལྗོན་ཐམས་ཅད་དང་། །ཀུན་དགའ་དག་དང་ནགས་ཚལ་རྣམས། །མེ་ཏོག་རབ་ཏུ་ཆགས་བྱེད་ཅིང་། །སྣ་ཚོགས་དྲི་ནི་རབ་ཏུ་འབྱིན། །
en: “All the fruit trees, The parks, and the forests Will blossom with flowers Emitting their various aromas.

source: མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་དང་། །འབྲས་བུ་སྣ་ཚོགས་ལྡན་པ་ཡི། །རྩྭ་དང་ནགས་ཚལ་ཐམས་ཅད་དག །ས་ཡི་སྟེང་ན་སྐྱེ་བར་བྱེད། །
en: “All the plants and trees That have various kinds of flowers And various kinds of fruits Will grow upon the earth.

source: འཛམ་བུའི་གླིང་འདི་ཐམས་ཅད་ན། །ཀླུ་ཡི་བུ་མོ་བསམ་མི་ཁྱབ། །རབ་ཏུ་དགའ་བའི་སེམས་གྱུར་ནས། །རྫིང་བུའི་དྲུང་དུ་ཉེར་སོང་སྟེ། །
en: “Throughout the entirety of this Jambudvīpa, There will be innumerable nāga maidens Whose minds will become filled with joy, And they will come to where the ponds are.

source: རྫིང་བུ་རྣམས་ནི་ཐམས་ཅད་དུ། །ཀུ་མུ་ད་དང་པདྨ་དང་། །ཨུཏྤ་ལ་དང་དེ་བཞིན་དུ། །པདྨ་དཀར་པོ་སྣ་ཚོགས་སྐྱེ། །
en: “And there will grow in all the ponds A variety of night lotuses, Red lotuses, and similarly Blue lotuses and white lotuses.

source: ནམ་མཁའ་ལ་ནི་དུ་བ་དང་། །སྤྲིན་གྱི་དྲ་བ་མེད་ཅིང་དག །
en: “In the sky there will be no smoke, And it will not be covered by clouds.

source: མུན་པ་དང་ནི་རྡུལ་མེད་ཅིང་། །ཕྱོགས་རྣམས་རབ་ཏུ་འོད་གསལ་ལོ། །
en: There will be no darkness and no dust, And everywhere will be completely bright.

source: ཉི་མའི་འོད་ཟེར་སྟོང་ལྡན་ཡང་། །འོད་ཟེར་དྲ་བས་འོད་ཀྱང་མཛེས། །སྣང་བ་དག་ནི་ཟབ་མོ་ཡིས། །རབ་ཏུ་དགའ་བར་འཆར་བར་འགྱུར། །
en: “A bright and beautiful net of light rays That has a thousand rays of sunlight Brings the most perfect joy With its profound brightness.

source: དབང་པོ་ཉི་མ་ལྷ་ཡི་བུ། །འཛམ་བུ་གླིང་གི་གསེར་གྱི་ནི། །གཞལ་མེད་ཁང་ན་འདུག་པ་ཡང་། །མདོ་སྡེ་འདིས་ནི་རབ་ཏུ་ཚིམ། །
en: “Even that lord, the deva Sūrya, Dwelling in his divine palace Made of Jambū River gold, Will gain satisfaction through this sūtra.

source: དབང་པོ་ཉི་མ་རབ་དགའ་ནས། །འཛམ་བུའི་གླིང་དུ་འཆར་བྱེད་ཅིང་། །འོད་ཟེར་མཐའ་ཡས་དྲ་བ་ཡི། །ཀུན་ནས་རབ་ཏུ་སྣང་བར་བྱེད། །
en: “When Lord Sūrya is gladdened, He will shine onto Jambudvīpa, And he will completely illuminate it With an infinite net of light rays.

source: དེ་ནི་ཤར་བ་ཙམ་གྱིས་ཀྱང་། །འོད་ཟེར་དྲ་བ་རབ་གཏོང་ཞིང་། །རྫིང་བུ་སྣ་ཚོགས་ཁེངས་པ་ཡི། །པདྨ་དག་ནི་ཁ་ཡང་འབྱེད། །
en: “Simply through his rising, He will shine a net of light rays, And the lotuses that fill A variety of ponds will open.

source: འཛམ་བུའི་གླིང་འདི་ཐམས་ཅད་དུ། །མེ་ཏོག་འབྲས་བུ་སྨན་སྣ་ཚོགས། །ཡང་དག་ཡོངས་སུ་སྨིན་བྱེད་ཅིང་། །ས་རྣམས་ཐམས་ཅད་ཚིམ་པར་བྱེད། །
en: “Throughout the entirety of this Jambudvīpa, The various flowers, fruits, and herbs Will perfectly, completely ripen, And the entire earth will be satisfied.

source: ཟླ་བ་དང་ནི་ཉི་མ་ཡང་། །དེ་ཚེ་ཁྱད་འཕགས་སྣང་བར་འགྱུར། །
en: “The moon and the sun also Will at that time be brighter.

source: རྒྱུ་སྐར་ཡང་དག་འབྱུང་འགྱུར་ཞིང་། །རླུང་ཡང་དེ་བཞིན་ལྡང་བར་འགྱུར། །
en: The lunar asterisms will move perfectly, And similarly so will the winds.

source: འཛམ་བུའི་གླིང་ནི་ཐམས་ཅད་དུ། །ཀུན་ཏུ་ལོ་ཡང་ལེགས་འགྱུར་ཏེ། །
en: “Throughout all of Jambudvīpa There will be excellent harvests.

source: གང་ན་མདོ་སྡེ་འདི་ཡོད་པ། །ཡུལ་འཁོར་དེ་ནི་ཁྱད་པར་འཕགས། །
en: Wherever this sūtra is present, That kingdom will be preeminent.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། གནོད་སྦྱིན་གྱི་གནས་ཞེས་བྱ་བ་ཀུན་ཏུ་བསྲུངས་པའི་ལེའུ་སྟེ་བཅུ་བཞི་པའོ།། །།དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་རིགས་ཀྱི་ལྷ་མོ་བྱང་ཆུབ་ཡང་དག་པར་བསྡུས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: This concludes “The Protection Given by Yakṣas,” the fourteenth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་འབར་བའི་ཁྱད་པར་གྱི་གཟི་བརྗིད་རྒྱལ་པོ་ལ་སོགས་པ་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་དག་རྒྱུ་གང་དང་རྐྱེན་གང་དང་། དགེ་བའི་རྩ་བ་སྦྱངས་པ་ཅི་འདྲ་བ་དང་གང་བགྱིས་ཤིང་བསགས་པས། སྐྱེས་བུ་དམ་པ་གསུམ་པོ་འདི་དག་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོས་ནས། ད་ལྟར་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་ནས་ལྷགས་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཆོས་མཉན་པའི་སླད་དུ་མཆིས་ན།
en: Chapter 15: The Prophecy to Ten Thousand Devas When the Bhagavat had said that, the noble goddess Bodhisattvasamuccayā asked him, “Venerable Bhagavat, through what cause and what condition, and through what accomplishment and accumulation of planting good roots, have Jvalanāntara­tejo­rāja and these other ten thousand devas now come from the Trāyastriṃśa paradise, having heard the prophecy to these three sublime beings?

source: འདི་ལྟ་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་སྐྱེས་བུ་དམ་པ་འདི་མ་འོངས་པའི་དུས་ན། བསྐལ་པ་བགྲང་བ་ལས་འདས་པ་གྲངས་མ་མཆིས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་གསེར་དུ་སྣང་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ།
en: “It was thus: this excellent being, the bodhisattva Ruciraketu, in a future time, after many hundreds of thousands of quintillions of asaṃkhyeyas of eons have passed, will attain the highest, most complete enlightenment of buddhahood in the world realm Suvarṇaprabhā.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གསེར་དང་རིན་པོ་ཆེའི་འབྱུང་གནས་གདུགས་བརྩེགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་འབྱུང་ངོ་། །ཇི་ཙམ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་དང་རིན་པོ་ཆེའི་འབྱུང་གནས་གདུགས་བརྩེགས་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དམ་པའི་ཆོས་ནུབ་སྟེ།
en: He will appear in that world as the tathāgata arhat samyak­saṃbuddha, the one with wisdom and virtuous conduct, the sugata, the one who knows the world’s beings, the unsurpassable guide who tames beings, the teacher of devas and humans, the buddha, the bhagavat by the name of Suvarṇa­ratnākaracchatra­kūṭa.

source: དེའི་བསྟན་པ་ཡོང་ཡེ་ཐམས་ཅད་ནུབ་པར་གྱུར་པ་ན། ཁྱེའུ་དངུལ་གྱི་ཏོག་འདི་དེ་བཞིན་གཤེགས་པ་དེའི་མཚམས་སྦྱོར་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རྡུལ་མེད་པའི་རྒྱལ་མཚན་དེ་ཉིད་དུ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་འཛམ་བུའི་གསེར་གྱི་རྒྱལ་མཚན་གྱི་འོད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་འབྱུང་ངོ་། །ཇི་ཙམ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་འཛམ་བུའི་གསེར་གྱི་རྒྱལ་མཚན་གྱི་འོད་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས། དེ་ཡི་བསྟན་པ་ཡོང་ཡེ་ཐམས་ཅད་དུ་ནུབ་པའི་བར་དུ་གྱུར་པ་ན་ཁྱེའུ་དངུལ་གྱི་འོད་འདི། དེ་བཞིན་གཤེགས་པ་དེའི་མཚམས་སྦྱོར་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རྡུལ་དང་བྲལ་བའི་རྒྱལ་མཚན་དེ་ཉིད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ།
en: “When the tathāgata arhat samyak­saṃbuddha Suvarṇa­ratnākaracchatra­kūṭa has passed into nirvāṇa and his Dharma has come to an end and his teachings have completely come to an end, at that time, this boy by the name of Rūpyaketu will appear as the tathāgata arhat samyak­saṃbuddha by the name of Suvarṇa­jambudhvajakāñca­nābha in the world realm called Virajadhvajā.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གསེར་བརྒྱའི་འོད་ཟེར་གསེར་དུ་སྣང་བ་སྙིང་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་འབྱུང་ངོ་། །
en: “When the tathāgata arhat samyak­saṃbuddha Suvarṇa­jambudhvajakāñca­nābha has passed into nirvāṇa and his Dharma has come to an end and his teachings have completely come to an end, then this boy by the name of Rūpyaprabha will be the successor of that tathāgata, attaining the highest enlightenment of complete buddhahood in the world realm called Immaculate Banner, appearing as the tathāgata arhat samyak­saṃbuddha, the one with wisdom and virtuous conduct, the sugata, the one who knows the world’s beings, the unsurpassable guide who tames beings, the teacher of devas and humans, the buddha, the bhagavat by the name of Radiance of a Hundred Golden Lights.

source: ཞེས་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །
en: “All of that was the Bhagavat’s prophecy of their attainment of the highest, most complete enlightenment.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་འབར་བའི་ཁྱད་པར་གྱི་གཟི་བརྗིད་རྒྱལ་པོ་ལ་སོགས་པ་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་ནི་དེ་ཙམ་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རླབས་པོ་ཆེ་ཡང་མ་གྱུར།
en: “Venerable Bhagavat, Jvalanāntara­tejo­rāja and the rest of those ten thousand devas have not had such a great, extensive bodhisattva conduct as that.

source: སྔོན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ལ་སྤྱད་སྐད་ཀྱང་མི་གདའ།
en: “It is not said that they have previously practiced the six perfections.

source: ལག་པ་དང་རྐང་པ་དང་མིག་དང་ཡན་ལག་གི་དམ་པ་མགོ་དང་། བུ་དང་ཆུང་མ་དང་བུ་མོ་ཕངས་པ་དག་སྔོན་ཡོངས་སུ་བཏང་སྐད་ཀྱང་མི་གདའ། ནོར་དང་འབྲུ་དང་། འགྲོན་བུ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། དུང་དང་།
en: “It is not said that they have previously given away their arms, legs, eyes, the supreme limb of the head, or their beloved sons, wives, and daughters.

source: མན་ཤེལ་དང་། བྱི་རུ་དང་། དངུལ་དང་། ས་ལེ་སྦྲམ་དང་། རིན་པོ་ཆེ་རྣམས་སྔོན་ཡོངས་སུ་བཏང་སྐད་ཀྱང་མི་གདའ། བཟའ་བ་དང་། བཏུང་བ་དང་། བཞོན་པ་དང་། གོས་དང་། མལ་ཆ་དང་།
en: “It is not said that they have previously given away wealth, grain, cowries, gold, silver, jewels, pearls, beryl, conchs, crystals, coral, silver, or gold nuggets.

source: ཁང་ཁྱིམ་དང་། གཞལ་མེད་ཁང་དང་། ཀུན་དགའ་ར་བ་དང་། རྫིང་བུ་དང་། ལྟེང་ཀ་དག་སྔོན་ཡོངས་སུ་བཏང་སྐད་ཀྱང་མི་གདའ།
en: “It is not said that they have previously given away food, drink, steeds, clothes, beds, seats, houses, divine palaces, parks, ponds, or pools.

source: གླང་པོ་ཆེ་དང་། བ་ལང་དང་། རྟ་ཕོ་རྒོད་དང་། བྲན་ཕོ་དང་། བྲན་མོ་སྣ་ཚོགས་སྔོན་ཡོངས་སུ་བཏང་སྐད་ཀྱང་མི་གདའ་འདི་ལྟ་སྟེ།
en: “It is not said that they have previously given away elephants, oxen, stallions, male servants, or female servants.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མ་མཆིས་པ་ཕྲག་དུ་མ་དེ་དག་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལས། དེ་བཞིན་གཤེགས་པའི་མིང་དུ་ལུང་མ་ཐོབ་ཀྱི་བར་དུ་སྔོན་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་གྲངས་མ་མཆིས་པ་དུ་མ་ནས། དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་གྲངས་མ་མཆིས་པ་དུ་མ་དག་ལ་མཆོད་པ་སྣ་ཚོགས་ཐ་དད་པ་བརྒྱ་སྟོང་བསམ་གྱིས་མི་ཁྱབ་པ་ཕྲག་དུ་མ་དང་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་མཆོད་པ་བགྱིད།
en: “Countless hundreds of thousands of quintillions of bodhisattvas have, before they received from buddha bhagavats their names as tathāgatas, made countless hundreds of thousands of various offerings to countless hundreds of thousands of quintillions of tathāgatas for countless hundreds of thousands of quintillions of eons.

source: ཡོངས་སུ་བཏང་བར་བགྱི་བའི་དངོས་པོ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་གཏོང་ལ། ལག་པ་དང་། རྐང་པ་དང་།
en: They had given away all the things that could be given away.

source: མིག་དང་། ཡན་ལག་གི་དམ་པ་མགོ་དང་བུ་དང་། ཆུང་མ་དང་། བུ་མོ་ཕངས་པ་ཡོངས་སུ་བཏང་བར་བགྱི་བ་རྣམས་ཀྱང་ཡོངས་སུ་གཏོང་། ནོར་དང་།
en: They had given away their arms, legs, eyes, the supreme limb of the head, and their beloved sons, wives, and daughters.

source: འབྲུ་དང་། འགྲོན་བུ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། དངུལ་དང་། ས་ལེ་སྦྲམ་ཡོངས་སུ་བཏང་བར་བགྱི་བ་རྣམས་ཡོངས་སུ་གཏོང་། བཟའ་བ་དང་། བཏུང་བ་དང་། བཞོན་པ་དང་། གོས་དང་། མལ་ཆ་དང་། སྟན་དང་།
en: They had given away wealth, grain, cowries, gold, silver, jewels, pearls, beryl, conchs, crystals, coral, silver, and gold nuggets.

source: ཁང་ཁྱིམ་དང་། གཞལ་མེད་ཁང་དང་། ཀུན་དགའ་ར་བ་དང་། སྐྱེད་མོས་ཚལ་དང་། རྫིང་བུ་དང་། ལྟེང་ཀ་དང་། གླང་པོ་ཆེ་དང་།
en: They had given away food, drink, steeds, clothes, beds, seats, houses, divine palaces, parks, pleasure groves, ponds, pools, elephants, oxen, stallions, male servants, and female servants.

source: བ་ལང་དང་། རྟ་ཕོ་རྒོད་དང་། བྲན་ཕོ་དང་། བྲན་མོ་ཡོངས་སུ་བཏང་བར་བགྱི་བ་རྣམས་ཀྱང་ཡོངས་སུ་གཏོང་ཞིང་རིམ་གྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིད། རིམ་གྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ནས་བདེ་བ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་ཡང་མྱོང་བར་འགྱུར་ན།
en: They had successively completed all the six perfections and, having successively completed all the six perfections, they experienced many hundreds of thousands of kinds of happiness.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་རྒྱུ་གང་དང་རྐྱེན་གང་དང་དགེ་བའི་རྩ་བ་སྦྱངས་པ་ཅི་འདྲ་བ་ཞིག་གིས་འབར་བའི་ཁྱད་པར་གྱི་གཟི་བརྗིད་རྒྱལ་པོ་ལ་སོགས་པ་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་འདི་དག །བཅོམ་ལྡན་འདས་ལ་ཆོས་ཉན་པའི་སླད་དུ་མཆིས་པ་འདི་དག་བཅོམ་ལྡན་འདས། འདི་ལྟར་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་པ་དུ་མ་ན། འཇིག་རྟེན་གྱི་ཁམས་སཱ་ལའི་དབང་པོ་མཐོན་པོའི་རྒྱལ་མཚན་དང་ལྡན་པ་ཞེས་བྱ་བ་དེ་ཉིད་དུ་རིགས་དང་། རུས་གཅིག་པ་དང་། མིང་གཅིག་ཏུ་རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། རབ་ཏུ་དང་བའི་ཞལ་ཨུཏྤ་ལའི་དྲི་བརྩེགས་པ་ཞེས་བྱ་བར་སངས་རྒྱས་སྟོང་ཕྲག་བཅུ་འཇིག་རྟེན་དུ་འབྱུང་སྟེ། མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འགྱུར་རོ་ཞེས་དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ལགས།
en: “Venerable Bhagavat, through what cause and what condition, through what manner of developing good roots, have Jvalanāntara­tejo­rāja and the rest of these ten thousand devas who have come here to hear the Dharma from the Bhagavat been prophesied to successively appear, Bhagavat, in a future time, after many hundreds of thousands of quintillions of asaṃkhyeya eons, in a world realm called Śālendra­dhvajāgravatī, in the same family, in the same clan, and with the same name, to attain the highest, most complete enlightenment of perfect buddhahood as ten thousand buddhas by the name of Prasanna­vadanotpala­gandha­kūṭa, becoming tathāgatas, arhats, samyak­saṃbuddhas, with wisdom and virtuous conduct, sugatas, knowers of the world’s beings, unsurpassable guides who tame beings, teachers of devas and humans, buddhas, and bhagavats?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རིགས་ཀྱི་ལྷ་མོ་བྱང་ཆུབ་ཡང་དག་པར་བསྡུས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་ལྷ་མོ་འབར་བའི་ཁྱད་པར་གྱི་གཟི་བརྗིད་རྒྱལ་པོ་ལ་སོགས་པ་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་འདི་དག་གང་བྱས་ཤིང་བསགས་པས་ཆོས་མཉན་པའི་ཕྱིར་ད་ལྟར་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་ནས་འདིར་ལྷགས་པ་དེའི་དགེ་བའི་རྩ་བ་སྦྱངས་པ་ཡོད། དེའི་རྒྱུ་ཡོད།
en: When she had asked that, the Bhagavat said, “Noble goddess, Jvalanāntara­tejo­rāja and the rest of these ten thousand devas do have a development of good roots, do have a cause, and do have deeds that they have accomplished and accumulated, through which they have come here from the paradise of Trāyastriṃśa in order to hear the Dharma.

source: དེའི་བྱེད་པ་ཡོད་དེ། རིགས་ཀྱི་ལྷ་མོ་སྐྱེས་བུ་དམ་པ་འདི་གསུམ་གྱི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་འདི་ཐོས་ནས་ཐོས་མ་ཐག་ཏུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལ་ཤིན་ཏུ་རི་མོ་བྱེད་ཅིང་དགའ་བ་དང་དང་བ་ཐོབ་པར་གྱུར་ཏེ་དེ་ཙམ་དུ་བཻ་ཌཱུརྱ་དྲི་མ་མེད་པ་ལྟར་ཡོངས་སུ་དག་པའི་སེམས་དང་ལྡན་པར་གྱུར་ཏོ། །
en: “Noble goddess, when they heard the prophecy of the enlightenment of these three excellent beings, as soon as they heard it, they gained reverence for, delight in, and trust in this Lord King of Sūtras, the Sublime Golden Light, and just through that they had minds that were as completely pure as stainless beryl.

source: དྲི་མ་མེད་ལ་ཤིན་ཏུ་རྒྱ་ཆེ་ཞིང་རྒྱས་པའི་ནམ་མཁའ་ལྟར་ཟབ་པའི་སེམས་རབ་ཏུ་དང་བ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: They had profound, completely clear minds like pure, extremely vast, and expansive space.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་བཟུང་བ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: They possessed an immeasurable accumulation of merit.

source: རིགས་ཀྱི་ལྷ་མོ་འབར་བའི་ཁྱད་པར་གྱི་གཟི་བརྗིད་རྒྱལ་པོ་ལ་སོགས་པ་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་འདི་དག་དེ་ཙམ་དུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཐོས་མ་ཐག་ཏུ་ལྷག་པར་རི་མོ་བྱེད་པ་དང་རབ་ཏུ་དང་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: “Noble goddess, Jvalanāntara­tejo­rāja and the rest of these ten thousand devas, in just that way, as soon as they heard this Lord King of Sūtras, the Sublime Golden Light, gained reverence for and trust in it.

source: དེ་ཙམ་དུ་བཻ་ཌཱུརྱ་དྲི་མ་མེད་པ་ལྟར་ཡོངས་སུ་དག་པའི་སེམས་དང་ལྡན་པར་གྱུར་ཏེ། དེའི་ཕྱིར་ལུང་བསྟན་པའི་ས་རྗེས་སུ་ཐོབ་བོ། །
en: In just that way, they had minds that were as completely pure as stainless beryl, and therefore they attained the level of prophecy.
